У Git есть три основных состояния,
в которых могут находиться ваши файлы:
изменён (modified),
индексирован (staged)
зафиксирован (committed):

*К изменённым относятся файлы,
которые поменялись, но ещё не были зафиксированы.
*Индексированый это изменённый файл в его текущей версии,
отмеченный для включения в следующий коммит.
*Зафиксированный значит, что файл уже сохранён в вашей локальной базе.

Три секции проекта

рабочая копия (working tree) - Рабочая копия является
 снимком одной версии проекта.

область индексирования (staging area) —это файл, обычно находящийся
 в каталоге Git, в нём содержится информация о том,
  что попадёт в следующий коммит.

каталог Git (Git directory) -  это то место, где Git
 хранит метаданные и базу объектов вашего проекта.
 Это самая важная часть Git и это та часть, которая
 копируется при клонировании репозитория с другого компьютера.

Когда вы инициализируете репозиторий командой git init,
Git создаёт ветку с именем master по умолчанию.
Начиная с версии 2.28,
вы можете задать другое имя для создания ветки по умолчанию.

